In [0]:
import pandas as pd
import numpy as np

##Atividade 1.1 -

O texto a seguir foi extraído da página do IBOPE na Internet:
www.ibope.com.br. Aí temos parte da descrição da pesquisa sociodemográfica
realizada por esse instituto. Identifique as variáveis pesquisadas, classificando-as como qualitativas ou quantitativas.

“O Levantamento Socioeconômico (LSE) é a pesquisa do IBOPE Mídia que mapeia as características sociais, demográficas e
econômicas das famílias das principais regiões metropolitanas do
país. Oferece também outros dados essenciais para traçar a estratégia de marketing para um produto. Com uma base de dados
estendida em relação às outras pesquisas do IBOPE Mídia, o LSE
serve de base para outros estudos.
São levantados dados sobre a condição do domicílio entrevistado (condição da rua, tipo de imóvel) e sobre a condição socioeconômica do domicílio (informações sobre renda e classificação
econômica). Também são pesquisados o número de pessoas no
domicílio, a presença e a quantidade de crianças e adolescentes,
a idade, grau de instrução e condição de atividade do chefe da
casa e da dona-de-casa. A pesquisa levanta também dados sobre
a posse de bens, como geladeira, máquina de lavar, automóvel,
rádio, computador, telefone, entre outros, e acesso a serviços de
mídia, como TV por Assinatura, Internet, etc.”

Variáveis qualitativas:

* condição do domicílio entrevistado (condição da rua, tipo de imóvel);
* Grau de instrução;
* Idade;
* Presença de crianças;
* Se possuem bens.

Variáveis quantitativas:

* condição socioeconômica do domicílio (informações sobre renda e classificação econômica);
* Número de pessoas no domicílio; 
* Quantidade de crianças e adolescentes;
* Quantidade de bens.

## Atividade 1.2 -

Para o Departamento Financeiro, obteve-se a seguinte informação sobre
o sexo dos 23 funcionários:

M F F M M M F F M M M M M F M M F F M M M F F

onde M = Masculino e F = Feminino. 

Construa uma tabela de frequências para esses dados.

In [22]:
# substituindo "M" por 0 e "F" por 1, temos:
dados = [0,1,1,0,0,0,1,1,0,0,0,0,0,1,0,0,1,1,0,0,0,1,1]

sex = ['Masculino', 'Feminino']

fi, classes = np.histogram(dados, bins=2)
fr = np.around(fi/fi.sum()*100,decimals=2)
fc = np.cumsum(fi).astype(int)

Tabela = pd.DataFrame({'Classes':sex,'fi': fi,'fr(%)': fr,'Fc': fc}).set_index('Classes')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

           fi   fr(%)  Fc
Classes
Masculino  14   60.87  14
Feminino    9   39.13  23
Total      23  100.00   -

## Atividade 1.3 - 

Execute todos os exemplos até aqui usando as funções do Python trabalhadas em sala. Ver o notebook de exemplo.

Exemplo 1.1:

In [23]:
# Usando sexo masculino como 0 e feminino como 1, temos:
sex = ['Masculino', 'Feminino']
dados = [0,0,1,1,1,0,0,1,1,0,1,0,0,0,1]

fi, classes = np.histogram(dados, bins=2)
fr = np.around(fi/fi.sum()*100,decimals=2)
fc = np.cumsum(fi).astype(int)

Tabela = pd.DataFrame({'Sexo':sex,'fi': fi,'fr(%)': fr,'Fc': fc}).set_index('Sexo')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

           fi   fr(%)  Fc
Sexo
Masculino   8   53.33   8
Feminino    7   46.67  15
Total      15  100.00   -

In [24]:
# Usando:
'''
Solteiro = 0
Casado = 1
Divorciado = 2
Viúvo = 3
'''
Est_Civil = ['Solteiro', 'Casado', 'Divorciado', 'Viúvo']
dados = [1,3,1,0,0,1,1,2,1,1,0,2,0,0,0]

fi, classes = np.histogram(dados, bins=4)
fr = np.around(fi/fi.sum()*100,decimals=2)
fc = np.cumsum(fi).astype(int)

Tabela = pd.DataFrame({'Estado Civil':Est_Civil, 'fi': fi,'fr(%)': fr,'Fc': fc}).set_index('Estado Civil')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

              fi   fr(%)  Fc
Estado Civil
Solteiro       6   40.00   6
Casado         6   40.00  12
Divorciado     2   13.33  14
Viúvo          1    6.67  15
Total         15  100.00   -

##Atividade 1.4 - 
Construa a distribuição de frequência para o número de dependentes
dos funcionários do Departamento de Recursos Humanos, conforme dados no Exemplo 1.

In [25]:
N_dependentes = [3,1,0,0,1,3,4,2,2,3,0,2,0,1,0]

fa,classes= np.histogram(N_dependentes, bins='sqrt') 

fa = fa.astype(int)
fr = np.around(fa/fa.sum()*100,decimals=2) 
fc = np.cumsum(fa).astype(int)
    
classe_str = []
for i in range(len(classes)):
    if i<=len(classes)-2:
        classe_str.append('{:2.2f} |-- {:2.2f}' .format(classes[i],classes[i+1]))
    else:
        break

Tabela = pd.DataFrame({'Classes':classe_str,'fi': fa,'fr(%)': fr,'Fc': fc}).set_index('Classes')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']

Tabela

               fi   fr(%)  Fc
Classes
0.00 |-- 1.00   5   33.33   5
1.00 |-- 2.00   3   20.00   8
2.00 |-- 3.00   3   20.00  11
3.00 |-- 4.00   4   26.67  15
Total          15  100.00   -

##Exercícios (Pág. 19)

1. Na Tabela 1.4 temos informações sobre o sexo, a matéria predileta
(Português, Matemática, História, Geografia ou Ciências) no 2o grau
e a nota (número de questões certas) em um teste de múltipla escolha
com 10 questões de matemática, ministrado no primeiro dia de aula
dos calouros de Administração de uma universidade (dados fictícios).

(a) Classifique as variáveis envolvidas.

  * Sexo: Qualitativa
  * Matéria predileta: Qualitativa
  * Nota: Quantitativa

(b) Construa a tabela de frequências apropriada para cada uma das
variáveis.

Sexo:

In [26]:
# substituindo "M" por 0 e "F" por 1, temos:
#[F,M,F,F,M,M,F,F,F,M,F,M,M,M,M,M,F,F,M,M,F,F,M,M,F,F,M,M,F,F,F,M,MF,M,M,F,M,F,F,F,M]

dados = [1,0,1,1,0,0,1,1,1,0,1,0,0,0,0,0,1,1,0,0,1,1,0,0,1,1,0,0,1,1,1,0,0,1,0,0,1,0,1,1,1,0]
sex = ['Masculino', 'Feminino']

fi, classes = np.histogram(dados, bins=2)
fr = np.around(fi/fi.sum()*100,decimals=2)
fc = np.cumsum(fi).astype(int)

Tabela = pd.DataFrame({'Classes':sex, 'fi': fi, 'fr(%)': fr, 'Fc': fc}).set_index('Classes')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

           fi  fr(%)  Fc
Classes
Masculino  21   50.0  21
Feminino   21   50.0  42
Total      42  100.0   -

Matéria predileta:

In [27]:
# Usando:
'''
Português = 0
Matemática = 1
História = 2
Geografia = 3
Ciências = 4
'''
Materias = ['Português', 'Matemática', 'História', 'Geografia', 'Ciências']
dados = [2,1,0,2,4,2,1,0,2,4,0,1,3,3,1,1,0,3,3,0,1,3,2,1,0,3,4,2,1,0,1,3,2,1,0,3,1,0,1,1,0,1]

fi, classes = np.histogram(dados, bins=5)
fr = np.around(fi/fi.sum()*100,decimals=2)
fc = np.cumsum(fi).astype(int)

Tabela = pd.DataFrame({'Materias':Materias, 'fi': fi,'fr(%)': fr,'Fc': fc}).set_index('Materias')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

            fi   fr(%)  Fc
Materias
Português   10   23.81  10
Matemática  14   33.33  24
História     7   16.67  31
Geografia    8   19.05  39
Ciências     3    7.14  42
Total       42  100.00   -

Nota:

In [28]:
Notas = [5,8,8,6,5,6,8,4,2,6,8,2,4,9,7,1,8,5,9,5,8,6,3,5,5,5,7,4,7,7,6,6,9,8,5,6,7,5,5,5,9,8]

fa,classes= np.histogram(Notas, bins='sturges') 

fa = fa.astype(int)
fr = np.around(fa/fa.sum()*100,decimals=2) 
fc = np.cumsum(fa).astype(int)
    
classe_str = []
for i in range(len(classes)):
    if i<=len(classes)-2:
        classe_str.append('{:2.2f} |-- {:2.2f}' .format(classes[i],classes[i+1]))
    else:
        break

Tabela = pd.DataFrame({'Classes':classe_str,'fi': fa,'fr(%)': fr,'Fc': fc}).set_index('Classes')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

               fi  fr(%)  Fc
Classes
1.00 |-- 2.14   3   7.14   3
2.14 |-- 3.29   1   2.38   4
3.29 |-- 4.43   3   7.14   7
4.43 |-- 5.57  11  26.19  18
5.57 |-- 6.71   7  16.67  25
6.71 |-- 7.86   5  11.90  30
7.86 |-- 9.00  12  28.57  42
Total          42  99.99   -

3. Na Tabela 1.6 temos as frequências acumuladas do número de sinistros por apólice de seguro do ramo Automóveis. Complete a tabela,
calculando as frequências simples absolutas e relativas e também as
frequências acumuladas relativas.

In [29]:
N_sinistros = ['0', '<= 1', '<= 2', '<= 3', '<= 4']
dados = pd.read_csv('https://raw.githubusercontent.com/RafaelMunizz/Dados-Estat-stica/master/atividade.csv')

fi, classes = np.histogram(dados, bins=5)
fr = np.around(fi/fi.sum()*100,decimals=2)
fc = np.cumsum(fi).astype(int)

Tabela = pd.DataFrame({'Numero de sinistros': N_sinistros, 'fi': fi,'fr(%)': fr,'Fc': fc}).set_index('Numero de sinistros')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

                        fi   fr(%)     Fc
Numero de sinistros
0                     2913   13.14   2913
<= 1                  4500   20.30   7413
<= 2                  4826   21.77  12239
<= 3                  4928   22.23  17167
<= 4                  5000   22.56  22167
Total                22167  100.00      -

##Atividade 2.1

Na Tabela 2.2 temos as informações sobre idade e salário para os 15
funcionários do Departamento de Recursos Humanos. Construa uma tabela
de frequências para a idade, levando em conta as mesmas faixas etárias utilizadas acima.

In [30]:
Idades = [36,51,26,25,29,53,42,38,35,45,26,37,24,31,29]

fa,classes= np.histogram(Idades, bins='auto') 

fa = fa.astype(int)
fr = np.around(fa/fa.sum()*100,decimals=2) 
fc = np.cumsum(fa).astype(int)
    
classe_str = []
for i in range(len(classes)):
    if i<=len(classes)-2:
        classe_str.append('{:2.2f} |-- {:2.2f}' .format(classes[i],classes[i+1]))
    else:
        break

Tabela = pd.DataFrame({'Idades':classe_str,'fi': fa,'fr(%)': fr,'Fc': fc}).set_index('Idades')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

                 fi  fr(%)  Fc
Idades
24.00 |-- 29.80   6  40.00   6
29.80 |-- 35.60   2  13.33   8
35.60 |-- 41.40   3  20.00  11
41.40 |-- 47.20   2  13.33  13
47.20 |-- 53.00   2  13.33  15
Total            15  99.99   -

##Atividade 2.2

Construa uma distribuição de frequências agrupadas em 5 classes de
mesmo comprimento para os dados de salários da Tabela 2.2.

In [31]:
Salarios = [6300,5700,4500,3800,3200,7300,7100,5600,6400,7000,3700,6500,4000,5100,4500]

fa,classes= np.histogram(Salarios, bins=5) 

fa = fa.astype(int)
fr = np.around(fa/fa.sum()*100,decimals=2) 
fc = np.cumsum(fa).astype(int)
    
classe_str = []
for i in range(len(classes)):
    if i<=len(classes)-2:
        classe_str.append('{:2.2f} |-- {:2.2f}' .format(classes[i],classes[i+1]))
    else:
        break

Tabela = pd.DataFrame({'Salarios':classe_str,'fi': fa,'fr(%)': fr,'Fc': fc}).set_index('Salarios')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

                     fi   fr(%)  Fc
Salarios
3200.00 |-- 4020.00   4   26.67   4
4020.00 |-- 4840.00   2   13.33   6
4840.00 |-- 5660.00   2   13.33   8
5660.00 |-- 6480.00   3   20.00  11
6480.00 |-- 7300.00   4   26.67  15
Total                15  100.00   -

#Exercícios (Pág. 37)

1. Num estudo sobre a jornada de trabalho das empresas de Produtos
Alimentares foram levantados os dados da Tabela 2.6 relativos ao
total de horas trabalhadas pelos funcionários no mês de agosto (dados fictícios). Construa uma tabela de frequências usando 5 classes
de mesmo tamanho;

Construa outras tabelas usando outras métricas para cálculo da quantidade de classes. Comente sobre as diferenças nas distribuições obtidas.

In [0]:
Salarios = [3960, 5016, 13015, 8008, 6930, 5544, 4224, 6138, 118800, 57904, 72600, 100100, 55935, 7223, 3775, 4224,3216, 7392, 2530, 6930, 1815, 4338, 8065, 10910, 8408, 8624, 6864, 5742, 5749, 8514, 2631, 5236, 8527, 3010, 5914, 11748, 8501, 6512, 11458, 10094, 6721, 2631, 7082, 10318, 8008, 3590, 7128, 7929,10450, 6780, 5060, 5544, 6178, 13763, 9623, 14883,17864, 34848, 25300, 52800, 17732, 63923, 30360, 18876,30800, 19562, 49240, 49434, 26950, 22308, 21146, 14212,25520, 49251, 30976, 23338, 43648, 26796, 44880, 30008,30769, 16907, 33911, 27034, 16500, 14445, 28160, 42442,16507, 36960, 67760, 84084, 89888, 65340, 82280, 86152,91080, 99792, 77836, 76032]

fa,classes= np.histogram(Salarios, bins=5)
#fa,classes= np.histogram(Salarios, bins='auto')
#fa,classes= np.histogram(Salarios, bins='fd') 
#fa,classes= np.histogram(Salarios, bins='doane') 
#fa,classes= np.histogram(Salarios, bins='scott') 
#fa,classes= np.histogram(Salarios, bins='stone') 
#fa,classes= np.histogram(Salarios, bins='rice') 
#fa,classes= np.histogram(Salarios, bins='sturges') 
#fa,classes= np.histogram(Salarios, bins='sqrt')

Se os compartimentos forem int, ele definirá o número de compartimentos de largura igual no intervalo especificado (10, por padrão).

* 'auto'

Máximo de estimadores de 'sturges' e 'fd'. Oferece bom desempenho em todos os aspectos.

* 'Fd' (estimador de diaconis de Freedman)

Estimador robusto que leva em consideração a variabilidade e o tamanho dos dados.

* 'Doane'

Uma versão aprimorada do estimador de Sturges que funciona melhor com conjuntos de dados não normais.

* 'Scott'

Estimador menos robusto que leva em consideração a variabilidade e o tamanho dos dados.

* 'stone'

Estimador com base na estimativa de validação cruzada de exclusão única do erro quadrado integrado. Pode ser considerado como uma generalização da regra de Scott.

* 'rice'

O estimador não leva em consideração a variabilidade, apenas o tamanho dos dados. Geralmente superestima o número de posições necessárias.

* 'sturges'

O método padrão de R, considera apenas o tamanho dos dados. Somente ideal para dados gaussianos e subestima o número de posições para grandes conjuntos de dados não gaussianos.

* 'Sqrt'

Estimador de raiz quadrada (de tamanho de dados), usado pelo Excel e outros programas por sua velocidade e simplicidade.

In [33]:
fa = fa.astype(int)
fr = np.around(fa/fa.sum()*100,decimals=2) 
fc = np.cumsum(fa).astype(int)
    
classe_str = []
for i in range(len(classes)):
    if i<=len(classes)-2:
        classe_str.append('{:2.2f} |-- {:2.2f}' .format(classes[i],classes[i+1]))
    else:
        break

Tabela = pd.DataFrame({'Horas_Trabalhadas':classe_str,'fi': fa,'fr(%)': fr,'Fc': fc}).set_index('Horas_Trabalhadas')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

                         fi  fr(%)   Fc
Horas_Trabalhadas
1815.00 |-- 25212.00     63   63.0   63
25212.00 |-- 48609.00    17   17.0   80
48609.00 |-- 72006.00     9    9.0   89
72006.00 |-- 95403.00     8    8.0   97
95403.00 |-- 118800.00    3    3.0  100
Total                   100  100.0    -

2. Na Tabela 2.7 temos a população dos municípios de MG com mais de 50.000 habitantes, com base nos dados do Censo Demográfico 2000.
Construa uma tabela de frequências para a distribuição da população.

In [34]:
Populacao = [50097, 50300, 51024, 51497, 53957, 55303, 58335, 61651, 62907, 63605, 63980, 64387, 64854, 65291, 66277, 66690, 66957, 67123, 67512, 70033, 71478, 73007, 73130, 75216, 76422, 76862, 77789, 78616, 78772, 78997, 84135, 85065, 89091, 92101, 97211, 97451, 98322, 101974, 102836, 106766, 108998, 114126, 115352, 123881, 129424, 133044, 135627, 183962, 184871, 184903, 212496, 246846, 247131, 252051, 306675, 306947, 456796, 501214, 538017, 2238526]

fa, classes= np.histogram(Populacao, bins = 'auto') 

fa = fa.astype(int)
fr = np.around(fa/fa.sum()*100,decimals=2) 
fc = np.cumsum(fa).astype(int)
    
classe_str = []
for i in range(len(classes)):
    if i<=len(classes)-2:
        classe_str.append('{:2.2f} |-- {:2.2f}' .format(classes[i],classes[i+1]))
    else:
        break

Tabela = pd.DataFrame({'População':classe_str,'fi': fa,'fr(%)': fr,'Fc': fc}).set_index('População')
Tabela.loc['Total'] = [Tabela['fi'].sum(axis=0), Tabela['fr(%)'].sum(axis=0), '-']
Tabela

                           fi   fr(%)  Fc
População
50097.00 |-- 82279.78      30   50.00  30
82279.78 |-- 114462.56     12   20.00  42
114462.56 |-- 146645.34     5    8.33  47
146645.34 |-- 178828.12     0    0.00  47
178828.12 |-- 211010.90     3    5.00  50
...                        ..     ...  ..
2109794.88 |-- 2141977.66   0    0.00  59
2141977.66 |-- 2174160.44   0    0.00  59
2174160.44 |-- 2206343.22   0    0.00  59
2206343.22 |-- 2238526.00   1    1.67  60
Total                      60  100.01   -

[69 rows x 3 columns]